[
  {
    "name": "Alyssum",
    "meaning": "A ground cover plant",
    "fun fact": "Alyssum is often referred to as sweet alyssum. Used in herbal medicine as a diuretic, it can also be added to salad or used as a colorful edible garnish."
  },
  {
    "name": "Amaryllis",
    "meaning": "Sparkling",
    "fun fact": "The United States imports more than 10 million amaryllis bulbs every year, mainly from Holland and South Africa."
  },
  {
    "name": "Azalea",
    "meaning": "Dry",
    "fun fact": "In Mobile, Alabama, 50 high school seniors are chosen yearly to serve as official ambassadors for the city known as Azalea Trail Maids. The Maids wear a pastel-colored costume with a bodice, full skirt over a steel ring enforced hoop, pantaloons, gauntlets, cape, as well as a hat and parasol. Each costume costs between $3,500-$5,000 to construct."
  },
  {
    "name": "Blossom",
    "meaning": "Flower-like, to bloom",
    "fun fact": "The character Blossom Russo in the television show 'Blossom' was known to wear trademark hats adorned with oversized flowers."
  },
  {
    "name": "Calla",
    "meaning": "Beautiful, from the flower calla lily",
    "fun fact": "Callas have always been known as a symbol of beauty. In Roman mythology, Venus, the goddess of love, sex, and beauty, felt so threatened by the beauty of these flowers that she cursed them to make them less attractive. The curse produced the yellow spike found in the center of each flower."
  },
  {
    "name": "Camellia",
    "meaning": "Helper to the priest; the flower was named after Jesuit botanist Georg Joseph Kamel",
    "fun fact": " In China, the camellia flower symbolizes eternal love. The petals represent the woman, and the protective calyx (the green part of the stem that holds the petals together) represents the man. When flowers fade, the petals typically fall, off leaving the calyx intact. However, with camellias, the petals and calyx fall away together in devotion to one another."
  },
  {
    "name": "Chrysanta",
    "meaning": "A shortened form of the word Chrysanthemum, meaning 'golden flower'",
    "fun fact": "Chrysanthemum tea is a beverage popular in East and Southeast Asia, prepared by steeping dried chrysanthemum flowers in boiling water for a few minutes. The tea is said to reduce inflammation, calm the nerves, clear the mind, and boost the immune system, although so far the evidence for this has been restricted to animal studies."
  },
  {
    "name": "Cicely",
    "meaning": "Sweet cicely is a fern-like herb",
    "fun fact": "Sweet cicely is part of the celery family. It also goes by the common names myrrh, garden myrrh, and sweet chervil."
  },
  {
    "name": "Dahlia",
    "meaning": "Dahlia has more than one meaning. In Hebrew, it means 'flowering branch,' such as the tip of a grapevine or olive branch. The dahlia flower was named after Swedish botanist Anders Dahl. Dal is the Swedish word for “valley” and the dahlia is sometimes referred to as the 'valley flower.'",
    "fun fact": "Botanists in 18th-century Europe initially bred dahlias for food because of their edible tubers, which are said to taste like a mix between potatoes and radishes."
  },
  {
    "name": "Daisy",
    "meaning": "Day's eye",
    "fun fact": "Kathleen Kelly, the protagonist in the classic romantic comedy 'You've Got Mail,' is a big fan of daisies. She famously quips, 'They're so friendly. Don't you think daisies are the friendliest flower?'"
  },
  {
    "name": "Forsythia",
    "meaning": "Forsyth's flower",
    "fun fact": "The forsythia was named for the Scottish botanist William Forsyth, whose surname means 'man of peace.'"
  },
  {
    "name": "Heather",
    "meaning": "heather flowers represent admiration, solitude, and protection.",
    "fun fact": ""
  },
  {
    "name": "",
    "meaning": "",
    "fun fact": ""
  },
  {
    "name": "",
    "meaning": "",
    "fun fact": ""
  },
  {
    "name": "",
    "meaning": "",
    "fun fact": ""
  },
  {
    "name": "",
    "meaning": "",
    "fun fact": ""
  },
  {
    "name": "",
    "meaning": "",
    "fun fact": ""
  },
  {
    "name": "",
    "meaning": "",
    "fun fact": ""
  },
  {
    "name": "",
    "meaning": "",
    "fun fact": ""
  },
  {
    "name": "",
    "meaning": "",
    "fun fact": ""
  }
]


